&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	//TODO: Вставить содержимое обработчика
	Объект.ДатыУборки.Очистить();
	Если НЕ ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Объект.ДатаНачала = ТекущаяДатаСеанса();
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	Люди.Наименование,
	|	Люди.Родитель,
	|	Люди.Имя,
	|	Люди.Отчество,
	|	Люди.КонтактнаяИнформация.(
	|		НомерТелефона КАК Телефон),
	|	Люди.Очередь,
	|	Люди.Родитель,
	|	Люди.Ссылка
	|ИЗ
	|	Справочник.Люди КАК Люди
	|ГДЕ
	|	Люди.ПометкаУдаления = ЛОЖЬ
	|	И Люди.ЭтоГруппа = ЛОЖЬ
	|	И Люди.Членство = ИСТИНА
	|	И Люди.Трудосопособность = ИСТИНА";
	Выборка = Запрос.Выполнить().Выбрать();
   	
   	КоличествоЛюдей = Выборка.Количество();
   	Если КоличествоЛюдей > 10 Тогда 
   		КоличествоМесяцев = КоличествоЛюдей / 10 + 2;
   	Иначе 
   		КоличествоМесяцев = 2;
   	КонецЕсли;
   	НачалоГрафика	= Объект.ДатаНачала;
   	КонецУборки		= ДобавитьМесяц(НачалоГрафика, КоличествоМесяцев);
   	Сообщить(НачалоГрафика);
   	Сообщить(КонецУборки);
   	Сообщить(КоличествоМесяцев);
   	
    Пока Выборка.Следующий() Цикл
   		НоваяСтрока = Объект.ДатыУборки.Добавить();
    	НоваяСтрока.ФИО			= Выборка.Наименование+ " " + Выборка.Имя + " " + Выборка.Отчество;
    	НоваяСтрока.НомерТелефона	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Ссылка,
    	 		ТекущаяДатаСеанса(),Ложь);
    КонецЦикла;
   // Объект.Записать();

КонецПроцедуры

