Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ГрафикУборки";
	КомандаПечати.Представление = НСтр("ru = 'График уборки'");
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм = "ФормаСписка,ФормаДокумента";
	КомандаПечати.Порядок = 1;	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ГрафикУборки") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ГрафикУборки", 
			НСтр("ru = 'График уборки'"), ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ГрафикУборки"));
		
	КонецЕсли;

КонецПроцедуры

Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	Перем Ошибки;
	
		
	ПараметрыНоменклатуры	= Новый Структура;
	ТабличныйДокумент		= Новый ТабличныйДокумент;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
	
		//Если Не ПервыйДокумент Тогда
		//	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		//КонецЕсли;
		//ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало	= ТабличныйДокумент.ВысотаТаблицы + 1;
		Макет				= ПолучитьМакет(ИмяМакета);
		
		Если Макет = "ГрафикУборки" Тогда
			
			//Шапка 
			Шапка = Макет.ПолучитьОбласть("Шапка");
			//Шапка.Параметры.Заполнить(ЭтотОбъект);
			ТабличныйДокумент.Вывести(Шапка);
			
			Запрос = Новый Запрос();
			Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ГрафикиУборки.Ссылка,
			|	ГрафикиУборки.ДатыУборки.(
			|		НомерСтроки,
			|		ФИО,
			|		Дата,
			|		НомерТелефона)
			|ИЗ
			|	Документ.ГрафикиУборки КАК ГрафикиУборки
			|ГДЕ
			|	ГрафикиУборки.Ссылка = &ТекущийДокумент";
			
			СтрТабЧасти = Макет.ПолучитьОбласть("Строка");
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(СтрТабЧасти.Параметры,Выборка);
			КонецЦикла;
	
		КонецЕсли;
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
	КонецЦикла;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Возврат ТабличныйДокумент;
	
КонецФункции