Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ГрафикУборки";
	КомандаПечати.Представление = НСтр("ru = 'График уборки'");
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм = "ФормаСписка,ФормаДокумента";
	КомандаПечати.Порядок = 1;	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ГрафикУборки") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ГрафикУборки", 
			НСтр("ru = 'График уборки'"), ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ГрафикУборки"));
		
	КонецЕсли;

КонецПроцедуры

Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	Перем Ошибки;
	
		
	ПараметрыНоменклатуры	= Новый Структура;
	ТабличныйДокумент		= Новый ТабличныйДокумент;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		НомерСтрокиНачало	= ТабличныйДокумент.ВысотаТаблицы + 1;
		Макет				= ПолучитьМакет(ИмяМакета);
		
		Если Макет = "ГрафикУборки" Тогда
			
			 
		КонецЕсли;
		
	КонецЦикла;
	
	
	ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
	ТабличныйДокумент.Вывести(ОбластьШапки);
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Возврат ТабличныйДокумент;
	
КонецФункции